In [1]:
import pandas as pd

In [6]:
valores = [6,8,'azul', {'key':'value'}, (3,)]
indice = range(len(valores))

serie1= pd.Series(data = valores, index = indice) # Data = especificar de donde vienen los datos, Index = especificar de donde vienen los Ã­ndices
serie1

0                   6
1                   8
2                azul
3    {'key': 'value'}
4                (3,)
dtype: object

In [8]:
valores2 = [28, 'lentes', complex(3,4), 'conjuro 4', {'llave':'valor'}, (4,5,)]
indice2 = range(len(valores2))
serie2 = pd.Series(data = valores2, index = indice2)
serie2

0                    28
1                lentes
2                (3+4j)
3             conjuro 4
4    {'llave': 'valor'}
5                (4, 5)
dtype: object

In [ ]:
#Se pueden sumar, restar, multiplicar, dividir, etc. series siempre y cuando los tipos de datos elemento elemento soporten
#hacer esas operaciones entre ellos

In [9]:
import numpy as np

In [10]:
array = np.random.normal(-10,10, size = [4,4])
array

array([[ -3.96686991, -11.53104883,  -8.86320307, -12.90608771],
       [-15.60503435, -20.82165077,  -2.14591749,  -7.63732302],
       [-11.02070958,  -3.60407253, -26.08294346, -15.89186943],
       [ -1.6347788 , -22.28165641,  -0.61910171,  -4.94261621]])

In [11]:
pd.DataFrame([[2,3],[4,5]], index = ['a','b'], columns = ['w', 'x'])

   w  x
a  2  3
b  4  5

In [13]:
pd.DataFrame(array, index = range(1, len(array)+1))

           0          1          2          3
1  -3.966870 -11.531049  -8.863203 -12.906088
2 -15.605034 -20.821651  -2.145917  -7.637323
3 -11.020710  -3.604073 -26.082943 -15.891869
4  -1.634779 -22.281656  -0.619102  -4.942616

In [17]:
df = pd.DataFrame(array, index = range(1, len(array)+1), columns = ['W', 'X', 'Y', 'Z'])
df

           W          X          Y          Z
1  -3.966870 -11.531049  -8.863203 -12.906088
2 -15.605034 -20.821651  -2.145917  -7.637323
3 -11.020710  -3.604073 -26.082943 -15.891869
4  -1.634779 -22.281656  -0.619102  -4.942616

In [20]:
df['X'] #Saca columnas

1   -11.531049
2   -20.821651
3    -3.604073
4   -22.281656
Name: X, dtype: float64

In [21]:
columnas = ['W','X']
df[columnas]

           W          X
1  -3.966870 -11.531049
2 -15.605034 -20.821651
3 -11.020710  -3.604073
4  -1.634779 -22.281656

In [22]:
df.X #Saca columnas

1   -11.531049
2   -20.821651
3    -3.604073
4   -22.281656
Name: X, dtype: float64

In [23]:
df.X + df.Y #TambiÃ©n se pueden hacer operaciones y son mutables

1   -20.394252
2   -22.967568
3   -29.687016
4   -22.900758
dtype: float64

In [25]:
df['suma_X_Z'] = df.X + df.Z #Agregar columnas
df

           W          X          Y          Z   suma_X_Z
1  -3.966870 -11.531049  -8.863203 -12.906088 -24.437137
2 -15.605034 -20.821651  -2.145917  -7.637323 -28.458974
3 -11.020710  -3.604073 -26.082943 -15.891869 -19.495942
4  -1.634779 -22.281656  -0.619102  -4.942616 -27.224273

In [29]:
df.drop('X', axis = 1, inplace=True) #axis = 1 es para borrar columnas, axis = 0 es para borrar filas
df# inplace borra permamentemente, dropea en el dataframe original

           W          Z   suma_X_Z
1  -3.966870 -12.906088 -24.437137
2 -15.605034  -7.637323 -28.458974
3 -11.020710 -15.891869 -19.495942
4  -1.634779  -4.942616 -27.224273

In [30]:
df.loc[3] #Acceder a filas

W          -11.020710
Z          -15.891869
suma_X_Z   -19.495942
Name: 3, dtype: float64

In [34]:
df.iloc[[0,2],[0,2]] #Se basa en el Ã­ndice original (empezando en 0 y sin considerar nombres)

          W   suma_X_Z
1  -3.96687 -24.437137
3 -11.02071 -19.495942

In [32]:
df

           W          Z   suma_X_Z
1  -3.966870 -12.906088 -24.437137
2 -15.605034  -7.637323 -28.458974
3 -11.020710 -15.891869 -19.495942
4  -1.634779  -4.942616 -27.224273

In [33]:
df.loc[3,'Z'] #filas, columnas segÃºn como estÃ¡n llamadas

np.float64(-15.891869427080994)

In [36]:
df.loc[[1,2], ['W', 'suma_X_Z']]

           W   suma_X_Z
1  -3.966870 -24.437137
2 -15.605034 -28.458974